Revit 2024 API
GroupTypeId.EnergyAnalysisBldgConsMtlThermalProps Property
 Material Thermal Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId EnergyAnalysisBldgConsMtlThermalProps { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisBldgConsMtlThermalProps As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisBldgConsMtlThermalProps {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace